[ {"id":1,"series":"TEEN TITANS GO!", "volume": "#44", "writers": "Amy Wolfram, Merrill Hagan, Sholly Fisch", "description": "Join Robin, Starfire, Beast Boy, Cyborg and Raven as they display their unique brand of hijinks, mayhem and justice in these stories from issues #1-6 of their new series! But giant pizza monsters aren’t the only dastardly and delicious villains on the menu...so dig in, Titans!", "image": "http://media.dcentertainment.com/sites/default/files/styles/covers192x291/public/gn-covers/2014/11/TeenTitansGo1-cvr_54616250626c65.77356902.jpg?itok=yDHvzISY" },
  {"id":2,"series":"THE FLASH SEASON ZERO", "volume": "#6", "writers": "Andrew Kreisberg",	"description": "A new story arc begins here! When peculiar homicides start to occur in Central City, Barry and Joe recruit the S.T.A.R. Labs team to help with the investigation. It isn’t long before the gang discovers something even more shocking when reports indicate that the wounds on the deceased appear to have been caused by…a great white shark! ", "image": "http://media.dcentertainment.com/sites/default/files/styles/covers192x291/public/comic-covers/2014/12/FLASH_SEASON0_6_548b43edf18d74.62310007.jpg?itok=wWz4WCFS" },
  {"id":3,"series":"HARLEY QUINN", "volume": "#15", "writers": "Jimmy Palmiotti, Amanda Conner", "description": "Harley was certain she could have it all: She could be the world’s best landlord, protect Coney Island from the scum of the Earth, woo Mason Macabre, work her day job as a psychiatrist, volunteer at the puppy shelter…but that’s a whole lot of spinning plates, and eventually they’re bound to start breaking! What happens when a psychopath cracks up? Is it possible for Harley to go even more insane?! ", "image": "http://media.dcentertainment.com/sites/default/files/styles/covers192x291/public/comic-covers/2014/11/HARLEY_Cv15_545d188871e8c0.36923578.jpg?itok=0fg3YFRr" }, 
  {"id":4,"series":"SCOOBY-DOO TEAM-UP", "volume": "#9",  "writers": "Sholly Fisch",	"description": "Superman needs help from Scooby and the gang – so they speed to Metropolis and the horribly haunted Daily Planet offices. But then Superman is turned into a super-powered monster! Even with help from Lois Lane, Jimmy Olsen and Krypto the Superdog, how can these meddling kids stop the transformed Man-Monster of Steel before he wrecks the city?", 	"image": "http://media.dcentertainment.com/sites/default/files/styles/covers192x291/public/comic-covers/2014/12/SDOTU_009_SolicitsCover_548b7694703b77.64570210.jpg?itok=TK6iXV6H" },
  {"id":5,"series":"THE NEW 52: FUTURES END 2014", "volume": "#44",  "writers": "Keith Giffen, Dan Jurgens, Jeff Lemire, Brian Azzarello",	"description": "The final stages of Brainiac’s plan come to fruition in this issue that leads directly into CONVERGENCE! The ripples of this story will literally be felt across the Multiverse. ", 	"image": "http://media.dcentertainment.com/sites/default/files/styles/covers192x291/public/comic-covers/2015/02/FUTEND_Cv44_ds_54f248239d76e8.30164436.jpg?itok=DpdSDI3z" },
  {"id":6,"series":"JUSTICE LEAGUE", "volume": "#1",  "writers": "Jeff Lemire",	"description": "In the aftermath of FOREVER EVIL, Adam Strange is caught up in an adventure across the far reaches of the cosmos that will unite an unexpected team of heroes including Supergirl, Hawkman, Green Arrow, Stargirl, Martian Manhunter and Animal Man – but if they’re on the team, who exactly is Canadian? And don’t miss the debut of the young Canadian hero known as Miiyahbin! It’s all here in stories from JLU #0-4, JUSTICE LEAGUE: FUTURES END #1 and JUSTICE LEAGUE UNITED: FUTURES END #1!", 	"image": "http://media.dcentertainment.com/sites/default/files/styles/covers192x291/public/gn-covers/2014/10/JL-United-v1_543ecf1d74dd13.50619680.jpg?itok=ajceTgJP" }
 ]